adafruit/seesaw/lib/samd21/samd21c/edc/ATSAMD21G16B.PIC
      <edc:SFRDef edc:_addr="0x42000418" edc:access="----nnnn----nnnnnnnnnnnnnnnnnnnn" edc:cname="INTFLAG" edc:impl="0xF0FFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="EVSYS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:desc="Channel 0 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:desc="Channel 1 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:desc="Channel 2 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:desc="Channel 3 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:desc="Channel 4 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:desc="Channel 5 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR6" edc:desc="Channel 6 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR7" edc:desc="Channel 7 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:desc="Channel 0 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:desc="Channel 1 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:desc="Channel 2 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:desc="Channel 3 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:desc="Channel 4 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:desc="Channel 5 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD6" edc:desc="Channel 6 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD7" edc:desc="Channel 7 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR8" edc:desc="Channel 8 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR9" edc:desc="Channel 9 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR10" edc:desc="Channel 10 Overrun" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVR11" edc:desc="Channel 11 Overrun" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="EVD8" edc:desc="Channel 8 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD9" edc:desc="Channel 9 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD10" edc:desc="Channel 10 Event Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVD11" edc:desc="Channel 11 Event Detection" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200041C" edc:offset="0x1BE4"/>
      <edc:SFRDef edc:_addr="0x42002000" edc:access="----nnnn---------nnnnnnn-nn---nn" edc:cname="CTRLA" edc:impl="0xF007F63" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TCC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RESOLUTION" edc:desc="Enhanced Resolution" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="Dithering is disabled" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DITH4" edc:desc="Dithering is done every 16 PWM frames" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DITH5" edc:desc="Dithering is done every 32 PWM frames" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DITH6" edc:desc="Dithering is done every 64 PWM frames" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:desc="Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="No division" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide by 2" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide by 4" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide by 8" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide by 16" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide by 64" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Divide by 256" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Divide by 1024" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCSYNC" edc:desc="Prescaler and Counter Synchronization Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="Reload or reset counter on next GCLK" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESC" edc:desc="Reload or reset counter on next prescaler clock" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RESYNC" edc:desc="Reload or reset counter on next GCLK and reset prescaler counter" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ALOCK" edc:desc="Auto Lock" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x9"/>
            <edc:SFRFieldDef edc:cname="CPTEN0" edc:desc="Capture Channel 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPTEN1" edc:desc="Capture Channel 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPTEN2" edc:desc="Capture Channel 2 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPTEN3" edc:desc="Capture Channel 3 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42002004" edc:access="nnnnnnnn" edc:cname="CTRLBCLR" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCC0">
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Counter Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LUPD" edc:desc="Lock Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONESHOT" edc:desc="One-Shot" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IDXCMD" edc:desc="Ramp Index Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="DISABLE" edc:desc="Command disabled: Index toggles between cycles A and B" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set index: cycle B will be forced in the next cycle" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="CLEAR" edc:desc="Clear index: cycle A will be forced in the next cycle" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="HOLD" edc:desc="Hold index: the next cycle will be the same as the current cycle" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="TCC Command" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RETRIGGER" edc:desc="Clear start, restart or retrigger" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="STOP" edc:desc="Force stop" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force update of double buffered registers" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="READSYNC" edc:desc="Force COUNT read synchronization" edc:when="(field &amp; 0x7) == 4"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
